
## :white_check_mark: Apply Succeeded (dev)

[CI link](https://github.com/a-company-jp/digi-baton/actions/runs/13621665102)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
azurerm_resource_group.state-demo-secure: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/state-demo]
azurerm_resource_group.digi_baton: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.backend will be created
  + resource "azurerm_container_registry" "backend" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + login_server                  = (known after apply)
      + name                          = "DigiBatonBackendDev"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "digi-baton"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_container_registry.crypto will be created
  + resource "azurerm_container_registry" "crypto" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + login_server                  = (known after apply)
      + name                          = "DigiBatonCryptoDev"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "digi-baton"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_container_registry.external will be created
  + resource "azurerm_container_registry" "external" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + login_server                  = (known after apply)
      + name                          = "DigiBatonExternalDev"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "digi-baton"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_container_registry.frontend will be created
  + resource "azurerm_container_registry" "frontend" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + login_server                  = (known after apply)
      + name                          = "DigiBatonFrontendDev"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "digi-baton"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.
azurerm_container_registry.backend: Creating...
azurerm_container_registry.crypto: Creating...
azurerm_container_registry.external: Creating...
azurerm_container_registry.frontend: Creating...
azurerm_container_registry.backend: Still creating... [10s elapsed]
azurerm_container_registry.crypto: Still creating... [10s elapsed]
azurerm_container_registry.frontend: Still creating... [10s elapsed]
azurerm_container_registry.external: Still creating... [10s elapsed]
azurerm_container_registry.frontend: Still creating... [20s elapsed]
azurerm_container_registry.backend: Still creating... [20s elapsed]
azurerm_container_registry.crypto: Still creating... [20s elapsed]
azurerm_container_registry.external: Still creating... [20s elapsed]
azurerm_container_registry.external: Creation complete after 20s [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonExternalDev]
azurerm_container_registry.crypto: Creation complete after 20s [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonCryptoDev]
azurerm_container_registry.frontend: Creation complete after 25s [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonFrontendDev]
azurerm_container_registry.backend: Still creating... [30s elapsed]
azurerm_container_registry.backend: Creation complete after 30s [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonBackendDev]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":14,"Program":"tfcmt","SHA1":"69072926d4732305854ec8cca262c93a00f3306a","Target":"dev","Vars":{},"WorkflowName":"Run Terragrunt Apply on main branch push"} -->